Catalogs/ОтраслевыеКоэффициентыНалогаНаИмущество.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ОтраслевыеКоэффициентыНалогаНаИмущество</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КоэфицентыНалогаНаИмущество.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КоэфицентыНалогаНаИмущество</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэфициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Классификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегиональныеКоэффициентыНалогаНаИмущество</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтраслевыеКоэффициентыНалогаНаИмущество</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗональныеКоэффициентыНалогаНаИмущество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ОтраслевыеКоэффициентыНалогаНаИмущество/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	СправочникМенеджер = Справочники.ОтраслевыеКоэффициентыНалогаНаИмущество;
	
	КлассификаторXML = СправочникМенеджер.ПолучитьМакет("Классификатор").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;     
	
	ПериодНабораЗаписей = НачалоГода(ТекущаяДатаСеанса()); 
	НаборЗаписей = РегистрыСведений.КоэфицентыНалогаНаИмущество.СоздатьНаборЗаписей(); 
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		Наименование = СокрЛП(СтрокаТаблицыЗначений.Name);
		Коэффициент = СтрокаТаблицыЗначений.Коэффициент; 
		
		СправочникСсылка = СправочникМенеджер.НайтиПоНаименованию(Наименование, Истина);
		
		Если СправочникСсылка.Пустая() Тогда
			СправочникСсылка = СправочникМенеджер.ПолучитьСсылку(Новый УникальныйИдентификатор);
			
			СправочникОбъект = СправочникМенеджер.СоздатьЭлемент();
			СправочникОбъект.УстановитьСсылкуНового(СправочникСсылка);
		Иначе
			СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		КонецЕсли;	
		
		СправочникОбъект.Наименование = Наименование;
		СправочникОбъект.Коэффициент = Коэффициент;
		
		БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
		
		// Записи в РС КоэфицентыНалогаНаИмущество
		НаборЗаписей.Отбор.Период.Установить(ПериодНабораЗаписей);
		НаборЗаписей.Отбор.Классификация.Установить(СправочникСсылка);
		НаборЗаписей.Прочитать();		
		НаборЗаписей.Очистить(); 

		ЗаписьНабораЗаписей = НаборЗаписей.Добавить();
		ЗаписьНабораЗаписей.Период = ПериодНабораЗаписей;
		ЗаписьНабораЗаписей.Классификация = СправочникСсылка;
		ЗаписьНабораЗаписей.Коэфициент = Коэффициент;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти
	
#КонецЕсли
